//問題と解答
qq = new Array();
qq[0] = ["この人物はだれ？","源義経","平清盛","聖徳太子",3];
qq[1] = ["この人物はだれ？","足利義満","鑑真","小野妹子",3];
qq[2] = ["この人物はだれ？","中大兄皇子（天智天皇）","徳川家康","源頼朝",1];
qq[3] = ["この人物はだれ？","中臣鎌足","清少納言","足利義政",1];
qq[4] = ["この人物はだれ？","本居宣長","聖武天皇","後醍醐天皇",2];
qq[5] = ["この人物はだれ？","北条時宗","一休","行基",3];
qq[6] = ["この人物はだれ？","伊能忠敬","聖徳太子","鑑真",3];
qq[7] = ["この人物はだれ？","藤原道長","平清盛","雪舟",1];
qq[8] = ["この人物はだれ？","巴御前","紫式部","西郷隆盛",2];
qq[9] = ["この人物はだれ？","清少納言","北条時子","淀殿",1];
qq[10] = ["この人物はだれ？","源頼朝","平清盛","鑑真",2];//平清盛
qq[11] = ["この人物はだれ？","源頼朝","聖徳太子","徳川家康",1];//源頼朝
qq[12] = ["この人物はだれ？","小野妹子","織田信長","源義経",3];//源義経
qq[13] = ["この人物はだれ？","北条早雲","北条時子","北条時宗",3];//北条時宗
qq[14] = ["この人物はだれ？","歌川広重","足利義満","徳川秀忠",2];//足利義満
qq[15] = ["この人物はだれ？","足利義政","織田信長","楠正成",1];//足利義政
qq[16] = ["この人物はだれ？","聖武天皇","雪舟","千利休",2];//雪舟
qq[17] = ["この人物はだれ？","織田信長","織田信成","源頼朝",1];//織田信長
qq[18] = ["この人物はだれ？","前田利家","上杉謙信","豊臣秀吉",3];//豊臣秀吉
qq[19] = ["この人物はだれ？","徳川家康","斎藤道三","中臣鎌足",1];//徳川家康
qq[20] = ["この人物はだれ？","徳川家光","伊能忠敬","徳川慶喜",1];//徳川家光
qq[21] = ["この人物はだれ？","豊臣秀吉","近松門左衛門","伊達政宗",2];//近松門左衛門
qq[22] = ["この人物はだれ？","前野良沢","歌川広重","吉田松陰",2];//歌川広重
qq[23] = ["この人物はだれ？","本居宣長","天草四郎","田沼意次",1];//本居宣長
qq[24] = ["この人物はだれ？","大塩平八郎","徳川吉宗","杉田玄白",3];//杉田玄白
qq[25] = ["この人物はだれ？","井伊直弼","松尾芭蕉","伊能忠敬",3];//伊能忠敬
qq[26] = ["この人物はだれ？","徳川光圀","近藤勇","勝海舟",3];//勝海舟
qq[27] = ["この人物はだれ？","近藤勇","西郷隆盛","北里柴三郎",2];//西郷隆盛
qq[28] = ["この人物はだれ？","土方歳三","大久保利通","田中正造",2];//大久保利通
qq[29] = ["この人物はだれ？","木戸孝允","野口英世","後藤象二郎",1];//木戸孝允
qq[30] = ["この人物はだれ？","明治天皇","孝明天皇","大正天皇",1];//明治天皇
qq[31] = ["この人物はだれ？","吉田松陰","榎本武揚","福沢諭吉",3];//福沢諭吉
qq[32] = ["この人物はだれ？","坂本龍馬","板垣退助","陸奥宗光",2];//板垣退助
qq[33] = ["この人物はだれ？","犬養毅","伊藤博文","大久保利通",2];//伊藤博文
qq[34] = ["この人物はだれ？","大久保利通","大隈重信","陸奥宗光",3];//陸奥宗光
qq[35] = ["この人物はだれ？","板垣退助","木戸孝允","東郷平八郎",3];//東郷平八郎
qq[36] = ["この人物はだれ？","小村寿太郎","陸奥宗光","板垣退助",1];//小村寿太郎
qq[37] = ["この人物はだれ？","大隈重信","小村寿太郎","伊藤博文",1];//大隈重信
qq[38] = ["この人物はだれ？","東郷平八郎","野口英世","吉田茂",2];//野口英世


//肖像画
const imgs = [
    '0.jpeg','1.jpeg','2.jpeg','3.jpeg','4.jpeg',
    '5.jpeg','6.jpeg','7.jpeg','8.jpeg','9.jpeg',
	'10.jpeg','11.jpeg','12.jpeg','13.jpeg','14.jpeg',
	'15.jpeg','16.jpeg','17.jpeg','18.jpeg','19.jpeg',
	'20.jpeg','21.jpeg','22.jpeg','23.jpeg','24.jpeg',
	'25.jpeg','26.jpeg','27.jpeg','28.jpeg','29.jpeg',
	'30.jpeg','31.jpeg','32.jpeg','33.jpeg','34.jpeg',
	'35.jpeg','36.jpeg','37.jpeg','38.jpeg'
    ];

//初期設定
var q_sel = 3; //選択肢の数

setReady();

//初期設定
function setReady() {
	count = 0;//問題番号
	ansers = [];//解答記録

	//最初の問題
	quiz();
}

//クイズをランダム表示


function takeRandom() {
    var a = [
    0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,
    21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36
];
    rnd = Math.floor(Math.random() * a.length);

    if (a.indexOf(rnd) >= 0){
        a.splice(rnd,1);
    }else {
        takeRandom();
    }
}

//問題表示
function quiz() {
	var s, n;
	//問題
    takeRandom();
	document.getElementById('question').innerHTML = (count + 1) + "問目：" + qq[rnd][0];
    document.getElementById('question-picture').innerHTML = (`<img src="${imgs[rnd]}" />`);
    //選択肢
	s = "";
	for (n=1;n<=q_sel;n++) {
        if (qq[rnd][n] !="") {
		    s += "(<a href='javascript:anser(" + n + ")'>" + n + "：" + qq[rnd][n] + "</a>)";
        }
    }
	document.getElementById("select").innerHTML = s;
}

//解答表示
function anser(num) {
	var s;
	s = (count + 1) + "問目：";
	//答え合わせ
	if (num == qq[rnd][q_sel + 1]) {
		//正解
		ansers[count] = "○";
	} else {
		ansers[count] = "×";
	}
    s += ansers[count] + qq[rnd][num];
	document.getElementById("answer").innerHTML = s;
	
	//次の問題を表示
	count++;
	if (count < 10) {
		quiz();
	} else {
		//終了
		s = "<table border='2'><caption>成績発表</caption>";
		//1行目
		s += "<tr><th>問題</th>";
		for (n=0;n<10;n++) {
			s += "<th>" + (n+1) + "</th>";
		}
		s += "</tr>";
		//2行目
		s += "<tr><th>成績</th>";
		for (n=0;n<10;n++) {
			s += "<td>" + ansers[n] + "</td>";
		}
		s += "</tr>";
		s += "</table>";
		document.getElementById("question").innerHTML = s;
		//次の選択肢
		s = "(<a href='index.html'>トップに戻る</a>)";
		s += "(<a href='javascript:setReady()'>もう一度挑戦</a>)";
		document.getElementById("select").innerHTML = s;
	}
}